atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/gpio_driver.c
            if (list_is_empty(&gpio_data->gpio_listeners)) {
                gpio_uninstall_isr_service();
            }

            return OK_ATOM;
        }
    }

    return ERROR_ATOM;
}

static term gpiodriver_set_int(Context *ctx, int32_t target_pid, term cmd)
{
    GlobalContext *glb = ctx->global;
    int32_t target_local_pid;

    struct GPIOData *gpio_data = ctx->platform_data;

    term gpio_num_term = term_get_tuple_element(cmd, 1);
    gpio_num_t gpio_num;
    if (LIKELY(term_is_integer(gpio_num_term))) {
        int32_t pin_int = term_to_int32(gpio_num_term);
        if (UNLIKELY((pin_int < 0) || (pin_int >= GPIO_NUM_MAX))) {
            return ERROR_ATOM;
        }
        gpio_num = (gpio_num_t) pin_int;
    } else {
        return ERROR_ATOM;
    }

    term trigger = term_get_tuple_element(cmd, 2);
    if (term_get_tuple_arity(cmd) == 4) {
        term pid = term_get_tuple_element(cmd, 3);
        if (UNLIKELY(!term_is_local_pid(pid) && !term_is_atom(pid))) {
            ESP_LOGE(TAG, "Invalid listener parameter, must be a pid() or registered process!");
            return ERROR_ATOM;
        }
        if (term_is_atom(pid)) {
            int pid_atom_index = term_to_atom_index(pid);
            pid = globalcontext_get_registered_process(ctx->global, pid_atom_index);
        }
        if (term_is_local_pid(pid)) {
            target_local_pid = term_to_local_process_id(pid);
        } else {
            ESP_LOGE(TAG, "Invalid listener parameter, must be a pid() or registered process!");
            return ERROR_ATOM;
        }
    } else {
        target_local_pid = target_pid;
    }


    /* TODO: GPIO specific atoms should be removed from platform_defaultatoms and constructed within this driver */
    gpio_int_type_t interrupt_type;
    switch (trigger) {
        case NONE_ATOM:
            interrupt_type = GPIO_INTR_DISABLE;
            break;

        case RISING_ATOM:
            interrupt_type = GPIO_INTR_POSEDGE;
            break;

        case FALLING_ATOM:
            interrupt_type = GPIO_INTR_NEGEDGE;
            break;

        case BOTH_ATOM:
            interrupt_type = GPIO_INTR_ANYEDGE;
            break;

        case LOW_ATOM:
            interrupt_type = GPIO_INTR_LOW_LEVEL;
            break;

        case HIGH_ATOM:
            interrupt_type = GPIO_INTR_HIGH_LEVEL;
            break;

        default:
            return ERROR_ATOM;
    }

    if (trigger != NONE_ATOM) {
        if (UNLIKELY(gpiodriver_is_gpio_attached(gpio_data, gpio_num))) {
            return ERROR_ATOM;
        }

        TRACE("going to install interrupt for %i.\n", gpio_num);

        if (list_is_empty(&gpio_data->gpio_listeners)) {
            gpio_install_isr_service(0);
            TRACE("installed ISR service 0.\n");
        }

        struct GPIOListenerData *data = malloc(sizeof(struct GPIOListenerData));
        if (IS_NULL_PTR(data)) {
            ESP_LOGE(TAG, "gpiodriver_set_int: Failed to ensure free heap space.");
            AVM_ABORT();
        }
        list_append(&gpio_data->gpio_listeners, &data->gpio_listener_list_head);
        data->gpio = gpio_num;
        data->target_local_pid = target_local_pid;
        sys_register_listener(glb, &data->listener);
        data->listener.sender = data;
        data->listener.handler = gpio_interrupt_callback;

        gpio_set_direction(gpio_num, GPIO_MODE_INPUT);
        gpio_set_intr_type(gpio_num, interrupt_type);

        esp_err_t ret = gpio_isr_handler_add(gpio_num, gpio_isr_handler, data);
        if (UNLIKELY(ret != ESP_OK)) {
            return ERROR_ATOM;
        }
    } else {
        if (UNLIKELY(!gpiodriver_is_gpio_attached(gpio_data, gpio_num))) {
            return ERROR_ATOM;
        }
        gpio_set_intr_type(gpio_num, interrupt_type);
        return unregister_interrupt_listener(ctx, gpio_num);
    }

    return OK_ATOM;
}

static term gpiodriver_remove_int(Context *ctx, term cmd)
{
    term gpio_num_term = term_get_tuple_element(cmd, 1);
    gpio_num_t gpio_num;
    if (LIKELY(term_is_integer(gpio_num_term))) {
        int32_t pin_int = term_to_int32(gpio_num_term);
        if (UNLIKELY((pin_int < 0) || (pin_int >= GPIO_NUM_MAX))) {
            return ERROR_ATOM;
        }
        gpio_num = (gpio_num_t) pin_int;
    } else {
        return ERROR_ATOM;
    }

    return unregister_interrupt_listener(ctx, gpio_num);
}

static term create_pair(Context *ctx, term term1, term term2)
{
    term ret = term_alloc_tuple(2, &ctx->heap);
    term_put_tuple_element(ret, 0, term1);
    term_put_tuple_element(ret, 1, term2);

    return ret;
}

static NativeHandlerResult consume_gpio_mailbox(Context *ctx)
{
    Message *message = mailbox_first(&ctx->mailbox);
    GenMessage gen_message;
    if (UNLIKELY(port_parse_gen_message(message->message, &gen_message) != GenCallMessage)) {
        ESP_LOGW(TAG, "Received invalid message.");
        mailbox_remove_message(&ctx->mailbox, &ctx->heap);
        return NativeContinue;
    }

    term cmd_term = term_get_tuple_element(gen_message.req, 0);

    int local_process_id = term_to_local_process_id(gen_message.pid);

    term ret;

    enum gpio_cmd cmd = interop_atom_term_select_int(gpio_cmd_table, cmd_term, ctx->global);
    switch (cmd) {
        case GPIOSetLevelCmd:
            ret = gpiodriver_set_level(ctx, gen_message.req);
            break;

        case GPIOSetDirectionCmd:
            ret = gpiodriver_set_direction(ctx, gen_message.req);
            break;

        case GPIOReadCmd:
            ret = gpiodriver_read(gen_message.req);
            break;

        case GPIOSetIntCmd:
            ret = gpiodriver_set_int(ctx, local_process_id, gen_message.req);
            break;

        case GPIORemoveIntCmd:
            ret = gpiodriver_remove_int(ctx, gen_message.req);
            break;

        case GPIOCloseCmd:
            ret = gpiodriver_close(ctx);
            break;

        default:
            ESP_LOGW(TAG, "Unrecognized command");
            ret = ERROR_ATOM;
    }

